In [1]:
import pandas as pd

#### Q1. List any five functions of the pandas library with execution.

#### 1. pd.DataFrame() :
used to create a new dataframe

In [2]:
data = [[3,4,5,6,7],[3,0,9,8,7],[4,3,5,6,7]]
df = pd.DataFrame(data)
df

   0  1  2  3  4
0  3  4  5  6  7
1  3  0  9  8  7
2  4  3  5  6  7

#### 2. mean() : 
used to get mean all numeric values column

In [3]:
df.mean()

0    3.333333
1    2.333333
2    6.333333
3    6.666667
4    7.000000
dtype: float64

#### 3. pd.describe()
Returns descriptive statistics about the data like mean, minimum, maximum, standard deviation, etc.

In [9]:
df.describe()

              0         1         2         3    4
count  3.000000  3.000000  3.000000  3.000000  3.0
mean   3.333333  2.333333  6.333333  6.666667  7.0
std    0.577350  2.081666  2.309401  1.154701  0.0
min    3.000000  0.000000  5.000000  6.000000  7.0
25%    3.000000  1.500000  5.000000  6.000000  7.0
50%    3.000000  3.000000  5.000000  6.000000  7.0
75%    3.500000  3.500000  7.000000  7.000000  7.0
max    4.000000  4.000000  9.000000  8.000000  7.0

#### 4. pd.info()
This method is used to generate the summary of the DataFrame, this will include info about columns with their names, their datatypes, and missing values.

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      int64
 1   1       3 non-null      int64
 2   2       3 non-null      int64
 3   3       3 non-null      int64
 4   4       3 non-null      int64
dtypes: int64(5)
memory usage: 252.0 bytes

#### 5. pd.isna()
Returns dataframe/series with bool values. Missing values gets mapped to True and non-missing gets mapped to False

In [11]:
df.isna()

       0      1      2      3      4
0  False  False  False  False  False
1  False  False  False  False  False
2  False  False  False  False  False

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [20]:
data = [['lea','hea','few'],['foo','zoo','moo'],['bean','team','lore']]
df = pd.DataFrame(data, columns = ['A','B','C'])
df

      A     B     C
0   lea   hea   few
1   foo   zoo   moo
2  bean  team  lore

In [21]:
df.reindex([1,3])

     A    B    C
1  foo  zoo  moo
3  NaN  NaN  NaN

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

#### For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [22]:
data = {'Values': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)
df

   Values
0      10
1      20
2      30
3      40
4      50

In [23]:
def sum_three(df):
    first_three = df.iloc[:3]  # select the first three rows
    return first_three.sum() 
sum_three(df)

Values    60
dtype: int64

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [24]:
data = {'Text':['goo','retr','iokjui']}
df = pd.DataFrame(data)
df

     Text
0     goo
1    retr
2  iokjui

In [25]:
df['Word_Count'] = df['Text'].str.len()
df

     Text  Word_Count
0     goo           3
1    retr           4
2  iokjui           6

#### Q5. How are DataFrame.size() and DataFrame.shape() different?

#### DataFrame.size
it is return number_row*number_column

In [26]:
df = pd.DataFrame({'name':['ye','fee','gol','jho'],
                   'Age':[3,4,5,7]})
df.size

8

#### DataFrame.shape
it is return number_row,number_column

In [27]:
df = pd.DataFrame({'name':['ye','fee','gol','jho'],
                   'Age':[3,4,5,7]})
df.shape

(4, 2)

#### Q6. Which function of pandas do we use to read an excel file?

pd.read_excel("excel_file_path")

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

#### The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [28]:
df = pd.DataFrame({'Email':['john.doe@example.com','nazer@gmail.com']})
df

                  Email
0  john.doe@example.com
1       nazer@gmail.com

In [29]:
df[['username','company']] = df['Email'].str.split("@",expand=True,)
df.drop(df.columns[2], axis=1, inplace=True)
df

                  Email  username
0  john.doe@example.com  john.doe
1       nazer@gmail.com     nazer

#### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

#### For example, if df contains the following values:

####       A B C

#### 0 3 5 1

#### 1 8 2 7

#### 2 6 9 4

#### 3 2 3 5 

#### 4 9 1 2

#### Your function should select the following rows: 

#### A B C

#### 1 8 2 7

#### 4 9 1 2

#### The function should return a new DataFrame that contains only the selected rows.

In [30]:
data = [[ 3, 5, 1],[8, 2, 7],[6, 9, 4],[2, 3, 5],[9, 1, 2]]
df = pd.DataFrame(data, columns = ['A','B','C'])
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [31]:
new_df = df[(df['A'] > 5)  & (df['B'] < 10 )]
new_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [32]:
df = pd.DataFrame({'Values': [2,3,4,5,6,7,8]})
df

   Values
0       2
1       3
2       4
3       5
4       6
5       7
6       8

In [33]:
df.mean()

Values    5.0
dtype: float64

In [35]:
df.std()

Values    2.160247
dtype: float64

In [36]:
df.median()

Values    5.0
dtype: float64

In [37]:
df.describe()

         Values
count  7.000000
mean   5.000000
std    2.160247
min    2.000000
25%    3.500000
50%    5.000000
75%    6.500000
max    8.000000

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [38]:
import numpy as np

In [39]:
df = pd.DataFrame(pd.date_range(start='2023-02-10' , end = '2023-02-26'), columns = ['Date'])
df['Sales'] = np.random.randint(100,1000,size=(17))
df[['Sales','Date']]

    Sales       Date
0     249 2023-02-10
1     898 2023-02-11
2     721 2023-02-12
3     851 2023-02-13
4     423 2023-02-14
5     805 2023-02-15
6     553 2023-02-16
7     441 2023-02-17
8     719 2023-02-18
9     141 2023-02-19
10    769 2023-02-20
11    146 2023-02-21
12    787 2023-02-22
13    689 2023-02-23
14    103 2023-02-24
15    514 2023-02-25
16    332 2023-02-26

In [40]:
df['Moving Average'] = df['Sales'].rolling(window=7).mean().round(2)
df

         Date  Sales  Moving Average
0  2023-02-10    249             NaN
1  2023-02-11    898             NaN
2  2023-02-12    721             NaN
3  2023-02-13    851             NaN
4  2023-02-14    423             NaN
5  2023-02-15    805             NaN
6  2023-02-16    553          642.86
7  2023-02-17    441          670.29
8  2023-02-18    719          644.71
9  2023-02-19    141          561.86
10 2023-02-20    769          550.14
11 2023-02-21    146          510.57
12 2023-02-22    787          508.00
13 2023-02-23    689          527.43
14 2023-02-24    103          479.14
15 2023-02-25    514          449.86
16 2023-02-26    332          477.14

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.


#### For example, if df contains the following values:

#### Date
#### O 2023-01-01
#### 1 2023-01-02
#### 2 2023-01-03
#### 3 2023-01-04
#### 4 2023-01-05

#### Your function should create the following DataFrame:

#### Date Weekday
#### 0 2023-01-01 Sunday
#### 1 2023-01-02 Monday
#### 2 2023-01-03 Tuesday
#### 3 2023-01-04 Wednesday
#### 4 2023-01-05 Thursday

#### The function should return the modified DataFrame.

In [43]:
date = pd.date_range(start='2023-01-01' , end = '2023-01-05')
df = pd.DataFrame({'Date':date})
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [44]:
df['Weekday'] = df['Date'].dt.day_name()
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

#### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [45]:
data = pd.date_range(start='2022-12-01', end='2023-02-28')
df_date = pd.DataFrame(data, columns=['Date'])
df_date

         Date
0  2022-12-01
1  2022-12-02
2  2022-12-03
3  2022-12-04
4  2022-12-05
..        ...
85 2023-02-24
86 2023-02-25
87 2023-02-26
88 2023-02-27
89 2023-02-28

[90 rows x 1 columns]

In [46]:
start = '2023-01-01'
end =  '2023-01-31'
mask = (df['Date'] > start) & (df['Date'] < end)
df.loc[mask]

        Date    Weekday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

#### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [ ]:
import pandas as pd